{
  "translation": {
    "yes": "Yes",
    "no": "No",
    "add": "Add",
    "save": "Save",
    "cancel": "Cancel",
    "delete": "Delete",
    "edit": "Edit",
    "title": "Title",
    "description": "Description",
    "clickToAddDescription": "Click here to add description",
    "close": "Close",
    "apply": "Apply",
    "status": "Status",
    "priority": "Priority",
    "date": "Date",
    "noDate": "Date not specified",
    "time": "Time",
    "noTime": "Time not specified",
    "estimate": "Estimation",
    "dueDate": "Due Date",
    "noDueDate": "Due date not specified",
    "timeSpent": "Time Spent",
    "checkList": "Check List",
    "tags": "Tags",
    "hideUnsorted": "Click to hide unsorted",
    "showUnsorted": "Click to show unsorted",
    "addNewTask": "Add New Task",
    "repeatable": "Repeatable",
    "notRepeatable": "Not Repeatable",
    "repeatTask": "Repeat",
    "repeatEvery": "Repeat every",
    "repeatType": "Repeat type",
    "itemsCount": {
      "urgent_one": "1 urgent priority task",
      "urgent_other": "{{count}} urgent priority tasks",
      "high_one": "1 high priority task",
      "high_other": "{{count}} high priority tasks",
      "normal_one": "1 normal priority task",
      "normal_other": "{{count}} normal priority tasks",
      "low_one": "1 low priority task",
      "low_other": "{{count}} low priority tasks"
    },
    "repeat": {
      "day_one": "Every day",
      "day_other": "Every {{count}} days",
      "week_one": "Every week",
      "week_other": "Every {{count}} weeks",
      "month_one": "Every month",
      "month_other": "Every {{count}} months",
      "year_one": "Every year",
      "year_other": "Every {{count}} years"
    },
    "repeatTypes": {
      "day": "Day",
      "week": "Week",
      "month": "Month",
      "year": "Year"
    },
    "priorityType": {
      "urgent": "Urgent",
      "high": "High",
      "normal": "Normal",
      "low": "Low"
    },
    "statusType": {
      "init": "Initial",
      "open": "Open",
      "inProgress": "In Progress",
      "done": "Done"
    },
    "estimation": "Estimation — {{estimate}}, Time Spent — {{timeSpent}}",
    "noTags": "No tags",
    "addTag": "Add tag",
    "editTags": "Edit tags",
    "deleteTagConfirm": "Are you sure you want to delete tag '{{name}}'?",
    "deleteTagConfirmDescription": "All tag settings will be lost!",
    "showStats": "Show in statistics",
    "deleteTaskConfirm": "Are you sure you want to delete task #{{id}}?",
    "expired": "Expired",
    "unsorted": "Unsorted",
    "estimateSum": "Sum",
    "checklist": {
      "addItem": "Add item",
      "defaultTitle": "Click here to change item title"
    },
    "export": "Export",
    "import": "Import",
    "downloadTasks": "Download tasks",
    "uploadTasks": "Upload tasks",
    "analyzeTasks": "Analyze tasks",
    "apiKeySaved": "API key saved!",
    "apiKeyNotSet": "API key not set!",
    "currentLanguage": "English",
    "analyze": "Analyze",
    "startAnalyze": "Start analyze",
    "restartAnalyze": "Restart analyze",
    "analyzeInProgress": "Analyzing...",
    "openAnalysis": "Open analysis",
    "analysisModalTitle": "Analysis",
    "analyzeTooltip": "Click to start analyze, when it's ready, you will see a message and the button will be colored in green",
    "analysisReady": "Analysis is ready! Click the analyze button to see the result.",
    "analyzerMessage": "Please analyze next serialized tasks array \"{{tasks}}\". The array is serialized in the following format: {{format}}. Please answer in english I don't know any other languages and I can't understand you.",
    "analyzerSystemMessage": "You are an assistant bot in a task management application. You must help the user in managing tasks. You will receive a serialized list of tasks. Each task has the following fields: id - unique task identifier title - task title description - task description repeatable - an object with information about the task's repeatability repeatable.repeatIndex - the index of task repeatability, if the task is repeated, multiple virtual instances of the task are created with different indices repeatable.repeatType - the type of task repeatability (day, week, month, year) repeatable.repeatValue - the value of task repeatability, a number indicating how many days, weeks, months, or years the task repeats repeatStatuses - an array of task statuses, if the task is repeated, array elements correspond to the indices of repeatability estimate - estimate of the effort required for the task, measured in arbitrary units, the user decides what one unit means timeSpent - actual effort spent on the task, measured in the same arbitrary units as estimate date - the date the task is performed time - the time the task is performed dueDate - the task's deadline date tags - list of task tags, you will also receive information about the tags. status - the status of the task, can be one of the following values: - initial - task created but not yet ready to be performed - open - task ready to be performed - inProgress - task in progress - done - task completed priority - task priority, can be one of the following values: - urgent - urgent task - high - high priority - normal - normal priority - low - low priority checkList - list of subtasks, each subtask has the following fields: - id - unique identifier of the subtask - title - title of the subtask - completed - flag of subtask completion Users are people without a technical background, so you should use simple words and not use technical terms. All field names must be translated into the user's language, use this JSON with translations {{translation}}. You must answer the following questions: - Is the application being used correctly? - What can be improved in the user's task planning? - What can be improved in the process of performing tasks, tracking tasks, managing tasks, managing time? - What risks exist in the current task management process? - Which functions of the application are being used incorrectly or not at all? Your task is to suggest to the user what can be improved in the processes to make the most of the application. Here is a brief description of the application's functions: The task management application allows the user to create, manage, track tasks, and manage time. Key features include:\nRecurring Tasks: Users can create tasks with repeatability, such as every 2 days or every week, with more repeatability options to be added later.\nTask Lists: Tasks are displayed in two lists:\nA list of tasks with a set due date, sorted by the date of completion and divided into sections by those dates.\nA list of tasks without a set due date, sorted by task priority and divided into two sections:\nOverdue tasks.\nTasks without a due date.\nSubtasks: Users can create subtasks that can be marked as completed or not completed.\nTags: Users can create tags for tasks. These can be simple string tags for categorizing tasks or tags used for gathering statistics on estimates and time spent, aiding in time management.\nDeadlines: Tasks can be created with deadlines. These tasks are displayed in all sections of all lists in the order of approaching deadlines.\nPriority Setting: Tasks can be assigned priorities indicating their level of importance. In all sections of all lists, tasks with priority are displayed in order of priority.\nThis application is designed to provide a comprehensive and user-friendly approach to task management, catering to various needs such as scheduling, prioritization, and time tracking. Address the user in the first person singular only",
    "settingsSaved": "Settings saved!",
    "settings": "Settings",
    "openAI": {
      "apiKey": "OpenAI API key",
      "apiKeyTooltip": "You can get the OpenAI API key",
      "apiKeyLink": "on the site"
    },
    "analyzer": {
      "askBot": "Ask something",
      "send": "Send",
      "hello": "Say hello",
      "buttonText": "Open chat"
    },
    "chat": {
      "you": "You",
      "bot": "Bot"
    }
  }
}