{
  "translation": {
    "yes": "Sí",
    "no": "No",
    "add": "Añadir",
    "save": "Guardar",
    "cancel": "Cancelar",
    "delete": "Eliminar",
    "edit": "Editar",
    "title": "Título",
    "description": "Descripción",
    "clickToAddDescription": "Haz clic para añadir una descripción",
    "close": "Cerrar",
    "apply": "Aplicar",
    "status": "Estado",
    "priority": "Prioridad",
    "date": "Fecha",
    "noDate": "Fecha no especificada",
    "time": "Hora",
    "noTime": "Hora no especificada",
    "estimate": "Estimación",
    "dueDate": "Fecha de vencimiento",
    "noDueDate": "Fecha de vencimiento no especificada",
    "timeSpent": "Tiempo invertido",
    "checkList": "Lista de verificación",
    "tags": "Etiquetas",
    "noTags": "Sin etiquetas",
    "hideUnsorted": "Hacer clic para ocultar sin clasificar",
    "showUnsorted": "Hacer clic para mostrar sin clasificar",
    "addNewTask": "Añadir nueva tarea",
    "repeatable": "Repetible",
    "notRepeatable": "No repetible",
    "repeatTask": "Repetir",
    "repeatEvery": "Repetir cada",
    "repeatType": "Tipo de repetición",
    "itemsCount": {
      "urgent_one": "1 tarea de prioridad urgente",
      "urgent_other": "{{count}} tareas de prioridad urgente",
      "high_one": "1 tarea de alta prioridad",
      "high_other": "{{count}} tareas de alta prioridad",
      "normal_one": "1 tarea de prioridad normal",
      "normal_other": "{{count}} tareas de prioridad normal",
      "low_one": "1 tarea de baja prioridad",
      "low_other": "{{count}} tareas de baja prioridad"
    },
    "repeat": {
      "day_one": "Cada día",
      "day_other": "Cada {{count}} días",
      "week_one": "Cada semana",
      "week_other": "Cada {{count}} semanas",
      "month_one": "Cada mes",
      "month_other": "Cada {{count}} meses",
      "year_one": "Cada año",
      "year_other": "Cada {{count}} años"
    },
    "repeatTypes": {
      "day": "Día",
      "week": "Semana",
      "month": "Mes",
      "year": "Año"
    },
    "priorityType": {
      "urgent": "Urgente",
      "high": "Alta",
      "normal": "Normal",
      "low": "Baja"
    },
    "statusType": {
      "init": "Inicial",
      "open": "Abierto",
      "inProgress": "En progreso",
      "done": "Hecho"
    },
    "estimation": "Estimación — {{estimate}}, Tiempo invertido — {{timeSpent}}",
    "addTag": "Añadir etiqueta",
    "editTags": "Editar etiquetas",
    "deleteTagConfirm": "¿Está seguro de que quiere eliminar la etiqueta '{{name}}'?",
    "deleteTagConfirmDescription": "¡Todos los ajustes de la etiqueta se perderán!",
    "showStats": "Mostrar en estadísticas",
    "deleteTaskConfirm": "¿Está seguro de que quiere eliminar la tarea n.º{{id}}?",
    "expired": "Caducado",
    "unsorted": "Sin clasificar",
    "estimateSum": "Suma",
    "checklist": {
      "addItem": "Añadir elemento",
      "defaultTitle": "Haz clic aquí para cambiar el título del elemento"
    },
    "export": "Exportar",
    "import": "Importar",
    "downloadTasks": "Descargar tareas",
    "uploadTasks": "Cargar tareas",
    "analyzeTasks": "Analizar tareas",
    "apiKeySaved": "¡Clave API guardada!",
    "apiKeyNotSet": "¡Clave API no establecida!",
    "currentLanguage": "Español",
    "analyze": "Analizar",
    "startAnalyze": "Iniciar análisis",
    "restartAnalyze": "Reiniciar análisis",
    "analyzeInProgress": "Analizando...",
    "openAnalysis": "Abrir análisis",
    "analysisModalTitle": "Análisis de tareas",
    "analyzeTooltip": "Haga clic para iniciar el análisis, cuando esté listo, verá un mensaje y el botón se coloreará en verde",
    "analysisReady": "El análisis está listo. Haga clic en el botón Analizar para ver el resultado.",
    "analyzerMessage": "Por favor, analice la siguiente cadena json del array de tareas \"{{tasks}}\". Por favor, conteste en español No conozco otros idiomas y no puedo entenderte.",
    "analyzerSystemMessage": "Eres un bot asistente en una aplicación de gestión de tareas. Debes ayudar al usuario a gestionar las tareas. Recibirás una lista de tareas en formato JSON. Cada tarea tiene los siguientes campos: id - identificador único de la tarea, título - título de la tarea, descripción - descripción de la tarea, repetible - un objeto con información sobre la repetibilidad de la tarea, repeatable.repeatIndex - el índice de repetibilidad de la tarea, si la tarea se repite, se crean múltiples instancias virtuales de la tarea con diferentes índices, repeatable.repeatType - el tipo de repetibilidad de la tarea (día, semana, mes, año), repeatable.repeatValue - el valor de repetibilidad de la tarea, un número que indica cuántos días, semanas, meses o años se repite la tarea, repeatStatuses - un arreglo de estados de la tarea, si la tarea se repite, los elementos del arreglo corresponden a los índices de repetibilidad, estimate - estimación del esfuerzo requerido para la tarea, medido en unidades arbitrarias, el usuario decide qué significa una unidad, timeSpent - esfuerzo real invertido en la tarea, medido en las mismas unidades arbitrarias que el estimate, fecha - la fecha en que se realiza la tarea, hora - el tiempo en que se realiza la tarea, dueDate - la fecha límite de la tarea, tags - lista de etiquetas de la tarea, también recibirás información sobre las etiquetas en formato JSON, estado - el estado de la tarea, puede ser uno de los siguientes valores: - initial - tarea creada pero aún no lista para ser realizada, - open - tarea lista para ser realizada, - inProgress - tarea en progreso, - done - tarea completada, prioridad - prioridad de la tarea, puede ser uno de los siguientes valores: - urgent - tarea urgente, - high - alta prioridad, - normal - prioridad normal, - low - baja prioridad, checkList - lista de subtareas, cada subtarea tiene los siguientes campos: - id - identificador único de la subtarea, - título - título de la subtarea, - completed - indicador de finalización de la subtarea. Los usuarios son personas sin conocimientos técnicos, por lo que debes usar palabras simples y no términos técnicos. Todos los nombres de campos deben ser traducidos al idioma del usuario, usa este JSON con traducciones {{translation}}. Debes responder a las siguientes preguntas: - ¿Se está utilizando correctamente la aplicación? - ¿Qué se puede mejorar en la planificación de tareas del usuario? - ¿Qué se puede mejorar en el proceso de realizar tareas, seguimiento de tareas, gestión de tareas, gestión del tiempo? - ¿Qué riesgos existen en el proceso actual de gestión de tareas? - ¿Qué funciones de la aplicación se están utilizando incorrectamente o no se utilizan en absoluto? Tu tarea es sugerir al usuario qué se puede mejorar en los procesos para aprovechar al máximo la aplicación. Aquí hay una breve descripción de las funciones de la aplicación: La aplicación de gestión de tareas permite al usuario crear, gestionar, realizar un seguimiento de las tareas y gestionar el tiempo. Las características clave incluyen:\nTareas recurrentes: Los usuarios pueden crear tareas con repetibilidad, como cada 2 días o cada semana, con más opciones de repetibilidad que se agregarán más tarde.\nListas de tareas: Las tareas se muestran en dos listas:\nUna lista de tareas con una fecha de vencimiento establecida, ordenada por la fecha de finalización y dividida en secciones por esas fechas.\nUna lista de tareas sin una fecha de vencimiento establecida, ordenada por la prioridad de la tarea y dividida en dos secciones:\nTareas vencidas.\nTareas sin una fecha de vencimiento.\nSubtareas: Los usuarios pueden crear subtareas que pueden marcarse como completadas o no completadas.\nEtiquetas: Los usuarios pueden crear etiquetas para tareas. Estas pueden ser etiquetas de cadena simple para categorizar tareas o etiquetas utilizadas para recopilar estadísticas sobre estimaciones y tiempo invertido, ayudando en la gestión del tiempo.\nPlazos: Se pueden crear tareas con plazos. Estas tareas se muestran en todas las secciones de todas las listas en el orden de los plazos que se acercan.\nEstablecimiento de prioridades: Las tareas pueden asignarse prioridades que indican su nivel de importancia. En todas las secciones de todas las listas, las tareas con prioridad se muestran en orden de prioridad.\nEsta aplicación está diseñada para proporcionar un enfoque integral y fácil de usar para la gestión de tareas, atendiendo a diversas necesidades como la programación, la priorización y el seguimiento del tiempo.",
    "settingsSaved": "¡Ajustes guardados!",
    "settings": "Ajustes",
    "openAI": {
      "apiKey": "Clave API de OpenAI",
      "apiKeyTooltip": "Puedes obtener la clave de la API de OpenAI",
      "apiKeyLink": "en"
    }
  }
}
