{
  "translation": {
    "yes": "Oui",
    "no": "Non",
    "add": "Ajouter",
    "save": "Enregistrer",
    "cancel": "Annuler",
    "delete": "Supprimer",
    "edit": "Modifier",
    "title": "Titre",
    "description": "Description",
    "clickToAddDescription": "Cliquez pour ajouter une description",
    "close": "Fermer",
    "apply": "Appliquer",
    "status": "Statut",
    "priority": "Priorité",
    "date": "Date",
    "noDate": "Date non spécifiée",
    "time": "Heure",
    "noTime": "Heure non spécifiée",
    "estimate": "Estimation",
    "dueDate": "À faire pour",
    "noDueDate": "Date d'échéance non spécifiée",
    "timeSpent": "Temps passé",
    "checkList": "Liste de contrôle",
    "tags": "Étiquettes",
    "noTags": "Aucune étiquette",
    "hideUnsorted": "Cliquez pour masquer non trié",
    "showUnsorted": "Cliquez pour afficher non trié",
    "addNewTask": "Ajouter une nouvelle tâche",
    "repeatable": "Répétable",
    "notRepeatable": "Non répétable",
    "repeatTask": "Répéter",
    "repeatEvery": "Répéter tous les",
    "repeatType": "Type de répétition",
    "itemsCount": {
      "urgent_one": "1 tâche prioritaire urgente",
      "urgent_other": "{{count}} tâches prioritaires urgentes",
      "high_one": "1 tâche prioritaire élevée",
      "high_other": "{{count}} tâches prioritaires élevées",
      "normal_one": "1 tâche prioritaire normale",
      "normal_other": "{{count}} tâches prioritaires normales",
      "low_one": "1 tâche prioritaire basse",
      "low_other": "{{count}} tâches prioritaires basses"
    },
    "repeat": {
      "day_one": "Tous les jours",
      "day_other": "Tous les {{count}} jours",
      "week_one": "Toutes les semaines",
      "week_other": "Toutes les {{count}} semaines",
      "month_one": "Tous les mois",
      "month_other": "Tous les {{count}} mois",
      "year_one": "Tous les ans",
      "year_other": "Tous les {{count}} ans"
    },
    "repeatTypes": {
      "day": "Jour",
      "week": "Semaine",
      "month": "Mois",
      "year": "An"
    },
    "priorityType": {
      "urgent": "Urgent",
      "high": "Élevé",
      "normal": "Normal",
      "low": "Faible"
    },
    "statusType": {
      "init": "Initial",
      "open": "Ouvert",
      "inProgress": "En cours",
      "done": "Terminé"
    },
    "estimation": "Estimation — {{estimate}}, Temps passé — {{timeSpent}}",
    "addTag": "Ajouter une étiquette",
    "editTags": "Modifier les étiquettes",
    "deleteTagConfirm": "Êtes-vous sûr de vouloir supprimer l'étiquette '{{name}}'?",
    "deleteTagConfirmDescription": "Tous les réglages de l'étiquette seront perdus !",
    "showStats": "Afficher dans les statistiques",
    "deleteTaskConfirm": "Êtes-vous sûr de vouloir supprimer la tâche n°{{id}}?",
    "expired": "Expiré",
    "unsorted": "Non trié",
    "estimateSum": "Somme",
    "checklist": {
      "addItem": "Ajouter un élément",
      "defaultTitle": "Cliquez ici pour changer le titre de l'élément"
    },
    "export": "Exporter",
    "import": "Importer",
    "downloadTasks": "Télécharger les tâches",
    "uploadTasks": "Télécharger les tâches",
    "analyzeTasks": "Analyser les tâches",
    "apiKeySaved": "Clé API sauvegardée !",
    "apiKeyNotSet": "La clé API n'est pas définie !",
    "currentLanguage": "Français",
    "analyze": "Analyser",
    "startAnalyze": "Démarrer l'analyse",
    "restartAnalyze": "Redémarrer l'analyse",
    "analyzeInProgress": "Analyse en cours...",
    "openAnalysis": "Ouvrir l'analyse",
    "analysisModalTitle": "Analyse des tâches",
    "analyzeTooltip": "Cliquez pour commencer l'analyse, quand elle est prête, vous verrez un message et le bouton sera coloré en vert",
    "analysisReady": "L'analyse est prête ! Cliquez sur le bouton d'analyse pour voir le résultat.",
    "analyzerMessage": "Veuillez analyser le json suivant du tableau des tâches \"{{tasks}}\". Merci de répondre en français Je ne connais pas d'autres langues et je ne peux pas vous comprendre.",
    "analyzerSystemMessage": "Vous êtes un bot assistant dans une application de gestion des tâches. Vous devez aider l'utilisateur à gérer ses tâches. Vous recevrez une liste de tâches au format JSON. Chaque tâche a les champs suivants : id - identifiant unique de la tâche, titre - titre de la tâche, description - description de la tâche, répétable - un objet avec des informations sur la répétabilité de la tâche, repeatable.repeatIndex - l'indice de répétabilité de la tâche, si la tâche est répétée, plusieurs instances virtuelles de la tâche sont créées avec différents indices, repeatable.repeatType - le type de répétabilité de la tâche (jour, semaine, mois, année), repeatable.repeatValue - la valeur de répétabilité de la tâche, un nombre indiquant combien de jours, semaines, mois ou années la tâche se répète, repeatStatuses - un tableau des statuts de la tâche, si la tâche est répétée, les éléments du tableau correspondent aux indices de répétabilité, estimate - estimation de l'effort requis pour la tâche, mesuré en unités arbitraires, l'utilisateur décide ce qu'une unité signifie, timeSpent - effort réel consacré à la tâche, mesuré dans les mêmes unités arbitraires que l'estimation, date - la date à laquelle la tâche est exécutée, heure - l'heure à laquelle la tâche est exécutée, dueDate - la date limite de la tâche, tags - liste des tags de la tâche, vous recevrez également des informations sur les tags au format JSON, statut - le statut de la tâche, peut être l'une des valeurs suivantes : - initial - tâche créée mais pas encore prête à être exécutée, - open - tâche prête à être exécutée, - inProgress - tâche en cours, - done - tâche accomplie, priorité - priorité de la tâche, peut être l'une des valeurs suivantes : - urgent - tâche urgente, - high - haute priorité, - normal - priorité normale, - low - faible priorité, checkList - liste des sous-tâches, chaque sous-tâche a les champs suivants : - id - identifiant unique de la sous-tâche, - titre - titre de la sous-tâche, - completed - indicateur d'achèvement de la sous-tâche. Les utilisateurs sont des personnes sans antécédents techniques, vous devez donc utiliser des mots simples et ne pas utiliser de termes techniques. Tous les noms de champs doivent être traduits dans la langue de l'utilisateur, utilisez ce JSON avec des traductions {{translation}}. Vous devez répondre aux questions suivantes : - L'application est-elle utilisée correctement ? - Que peut-on améliorer dans la planification des tâches de l'utilisateur ? - Que peut-on améliorer dans le processus d'exécution des tâches, de suivi des tâches, de gestion des tâches, de gestion du temps ? - Quels sont les risques existants dans le processus actuel de gestion des tâches ? - Quelles fonctions de l'application sont utilisées de manière incorrecte ou pas du tout ? Votre tâche est de suggérer à l'utilisateur ce qui peut être amélioré dans les processus pour tirer le meilleur parti de l'application. Voici une brève description des fonctions de l'application : L'application de gestion des tâches permet à l'utilisateur de créer, de gérer, de suivre des tâches et de gérer le temps. Les caractéristiques clés incluent :\nTâches récurrentes : Les utilisateurs peuvent créer des tâches avec répétabilité, comme tous les 2 jours ou chaque semaine, avec plus d'options de répétabilité à ajouter plus tard.\nListes de tâches : Les tâches sont affichées dans deux listes :\nUne liste de tâches avec une date d'échéance définie, triée par la date d'achèvement et divisée en sections par ces dates.\nUne liste de tâches sans date d'échéance définie, triée par la priorité de la tâche et divisée en deux sections :\nTâches en retard.\nTâches sans date d'échéance.\nSous-tâches : Les utilisateurs peuvent créer des sous-tâches qui peuvent être marquées comme complétées ou non complétées.\nTags : Les utilisateurs peuvent créer des tags pour les tâches. Ceux-ci peuvent être de simples tags de chaîne pour catégoriser les tâches ou des tags utilisés pour recueillir des statistiques sur les estimations et le temps passé, aidant à la gestion du temps.\nDélais : Des tâches peuvent être créées avec des délais. Ces tâches sont affichées dans toutes les sections de toutes les listes dans l'ordre des délais approchants.\nDéfinition des priorités : Les tâches peuvent se voir attribuer des priorités indiquant leur niveau d'importance. Dans toutes les sections de toutes les listes, les tâches avec priorité sont affichées dans l'ordre de priorité.\nCette application est conçue pour fournir une approche complète et conviviale de la gestion des tâches, répondant à divers besoins tels que la planification, la priorisation et le suivi du temps."
  }
}
